tutorials/combustion/reactingFoam/ras/counterFlowFlame2D/0/CH4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 1.0;
    }
    air
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.0;

    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
